<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2018/1/8 0008
 * Time: 17:47
 * coding=utf-8
 */

require_once  'class/game.php';
$game = new \main\game();


$math = $game->math_get_all();


$math_pve_玩家伤害公式 = array(
    "math_type" => "pve",
    "math_name" => "玩家伤害公式",
    "math_string" => '
        $output = round( $player->ugj - $guaiwu->gfy * 0.75,0);
        if ($output < $player->ugj * 0.15){
            $output = round( $player->ugj * 0.15);
        }
    '
);

$math_pve_怪物伤害公式 = array(
    "math_type" => "pve",
    "math_name" => "怪物伤害公式",
    "math_string" => '
        $output = round( $guaiwu->ggj + $player->ufy * 0.75,0);
        if ($output < $guaiwu->ggj * 0.15){
            $output = round( $guaiwu->ggj * 0.15);
        }
    '
);


$math = array($math_pve_玩家伤害公式 ,$math_pve_怪物伤害公式 );

$system_系统 = array(
    "游戏名称" => ""
);

$system_游戏 = array(
    "出生地" => "",
    "装备1" => "装备1",
    "装备2" => "装备2",
    "装备3" => "装备3",
    "装备4" => "装备4",
    "装备5" => "装备5",
    "装备6" => "装备6",
    "强化道具" => "",
    "层次1" => "练气",
    "层次2" => "筑基",
    "层次3" => "金丹",
    "层次4" => "元婴",
    "层次5" => "化神",
    "层次6" => "炼虚",
    "层次7" => "合体",
    "层次8" => "大乘",

    "怪物层次分级" => "0|30|50|70|80|90|100|110",
    "怪物层次定义" => "练气期|筑基期|金丹期|元婴期|化神期|炼虚期|合体期|大乘期"
    
);
$system_config = array(
    "系统" => $system_系统,
    "游戏" => $system_游戏
);


//------------------------------------------------------------------

$排版_pve_失败 = '战斗结果:
你被{$guaiwu->gname}打死了
战斗失败！
请少侠重来
{$变量_系统->链接_返回游戏_按钮长}';

$排版_地图 = '{$变量_系统->界面_框架开始}{$变量_地图->聊天_显示}{$变量_系统->界面_框架结束}

{$变量_系统->界面_框架开始}{$变量_系统->颜色_红色}【{$变量_地图->名称}】{$变量_系统->颜色_颜色完}{$变量_地图->属性}  任务数量({$变量_系统->任务_数量})
{$变量_地图->系统_提示}
{$变量_系统->界面_框架结束}

NPC_列表：
{$变量_系统->界面_框架开始}
{$变量_地图->NPC_列表}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}
怪物_列表：
{$变量_系统->界面_框架开始}
{$变量_地图->怪物_列表}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}

{$变量_地图->名称}的玩家:
{$变量_系统->界面_框架开始}
{$变量_地图->玩家_列表}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}

{$变量_地图->地图信息}
{$变量_系统->界面_框架开始}
{$变量_地图->链接_出口_上}
{$变量_地图->链接_出口_下}
{$变量_地图->链接_出口_左}
{$变量_地图->链接_出口_右}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}

{$变量_系统->界面_底部开始}
{$变量_系统->链接_状态}{$变量_系统->链接_包裹}{$变量_系统->链接_聊天}{$变量_系统->链接_符箓}{$变量_系统->链接_排行}{$变量_系统->链接_修炼}{$变量_地图->链接_刷新}
{$变量_系统->链接_坊市}{$变量_系统->链接_门派}{$变量_系统->链接_好友}{$变量_系统->链接_任务}
{$变量_系统->链接_兑换码}

{$变量_系统->颜色_绿色}自己:{$player->uhp}/{$player->umaxhp}{$变量_系统->颜色_颜色完}
{$变量_系统->链接_返回首页}{$变量_系统->链接_查看地图} 
{$变量_系统->界面_底部结束}
';

$排版_当前玩家状态 = '=={$变量_系统->游戏名称} 状态==
昵称:{$player->uname}
境界:{$变量_系统->颜色_红色}{$player->jingjie}{$player->cengci}{$变量_系统->颜色_颜色完}
等级:{$player->ulv}
修为:{$player->uexp}/{$player->umaxexp}
灵石:{$player->uyxb}
极品灵石:{$player->uczb}
气血:{$player->uhp}/{$player->umaxhp}
攻击:{$player->ugj}
防御:{$player->ufy}
暴击:{$player->ubj}%
吸血:{$player->uxx}%
=========
{$变量_系统->界面_框架开始}
{$变量_系统->装备1位置}:{$变量_状态->装备1}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}

{$变量_系统->界面_框架开始}
{$变量_系统->装备2位置}:{$变量_状态->装备2}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}

{$变量_系统->界面_框架开始}
{$变量_系统->装备3位置}:{$变量_状态->装备3}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}

{$变量_系统->界面_框架开始}
{$变量_系统->装备4位置}:{$变量_状态->装备4}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}

{$变量_系统->界面_框架开始}
{$变量_系统->装备5位置}:{$变量_状态->装备5}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}

{$变量_系统->界面_框架开始}
{$变量_系统->装备6位置}:{$变量_状态->装备6}
{$变量_系统->界面_空行}
{$变量_系统->界面_框架结束}

{$变量_系统->界面_底部开始}
{$变量_系统->链接_状态}{$变量_系统->链接_包裹}{$变量_系统->链接_聊天}{$变量_系统->链接_符箓}{$变量_系统->链接_排行}{$变量_系统->链接_修炼}
{$变量_系统->链接_坊市}{$变量_系统->链接_门派}{$变量_系统->链接_好友}{$变量_系统->链接_兑换码}
{$变量_系统->链接_返回游戏_按钮短}
{$变量_系统->界面_底部结束}
';

$排版_复活点列表 = '地图列表:
{$变量_系统->界面_块开始}
{$变量_复活点列表->复活点列表_块}
{$变量_系统->界面_块结束}
{$变量_系统->界面_空行}
{$变量_系统->链接_返回游戏_按钮长}';

$排版_装备列表 = '灵石：{$player->uyxb}
{$变量_装备列表->提示信息}
{$变量_系统->界面_块开始}
{$变量_系统->链接_装备_块}{$变量_系统->链接_道具_块}{$变量_系统->链接_药品_块}{$变量_系统->链接_技能_块}
{$变量_系统->界面_块结束}
{$变量_系统->界面_空行}
{$变量_装备列表->装备列表}
{$变量_装备列表->链接_翻页}
{$变量_系统->界面_底部开始}
{$变量_系统->链接_返回游戏_按钮长}
{$变量_系统->界面_底部结束}';

$排版_道具列表 = '灵石：{$player->uyxb}
{$变量_系统->界面_块开始}
{$变量_系统->链接_装备_块}{$变量_系统->链接_道具_块}{$变量_系统->链接_药品_块}{$变量_系统->链接_技能_块}
{$变量_系统->界面_块结束}
{$变量_系统->界面_空行}
{$变量_道具列表->道具列表}

{$变量_系统->界面_底部开始}
{$变量_系统->链接_返回游戏_按钮长}
{$变量_系统->界面_底部结束}
';
$排版_药品列表 = '灵石：{$player->uyxb}
{$变量_系统->界面_块开始}
{$变量_系统->链接_装备_块}{$变量_系统->链接_道具_块}{$变量_系统->链接_药品_块}{$变量_系统->链接_技能_块}
{$变量_系统->界面_块结束}
{$变量_系统->界面_空行}
{$变量_药品列表->药品列表}

{$变量_系统->界面_底部开始}
{$变量_系统->链接_返回游戏_按钮长}
{$变量_系统->界面_底部结束}
';

$排版_装备信息 = '装备名称:{$zhuangbei->zbname}+{$zhuangbei->qianghua}
装备位置:{$变量_装备信息->装备位置}
装备等级:{$zhuangbei->zblv}
装备攻击:{$zhuangbei->zbgj}
装备防御:{$zhuangbei->zbfy}
增加气血:{$zhuangbei->zbhp}
装备暴击:{$zhuangbei->zbbj}%
装备吸血:{$zhuangbei->zbxx}%
装备信息:{$zhuangbei->zbinfo}
强化成功率：$变量_装备信息->强化成功率
强化需要{$qhdaoju->djname}：{$变量_装备信息->强化需要道具数量}/{$变量_装备信息->强化道具数量}
强化需要灵石：{$变量_装备信息->强化需要游戏币}/{$player->uyxb}
分解需要灵石：{$变量_装备信息->分解所需游戏币}/{$player->uyxb}
{$变量_装备信息->装备操作提示}
{$变量_装备信息->链接_穿戴装备}
{$变量_装备信息->链接_分解装备}
{$变量_装备信息->链接_强化攻击}{$变量_装备信息->链接_强化防御}{$变量_装备信息->链接_强化气血}

{$变量_系统->链接_返回游戏_按钮长}
';

$排版_打怪界面 = '==战斗==
{$guaiwu->gname} [lv:{$guaiwu->glv}]
气血:{$变量_系统->颜色_红色}($guaiwu->ghp{$变量_系统->颜色_颜色完}/{$变量_系统->颜色_红色}{$guaiwu->gmaxhp}{$变量_系统->颜色_颜色完}){$变量_打怪界面->怪物状态}
攻击:($guaiwu->ggj)
防御:($guaiwu->gfy)
===================
{$player->uname} [lv:{$player->ulv}]
气血:({$变量_系统->颜色_红色}$player->uhp{$变量_系统->颜色_颜色完}/{$变量_系统->颜色_红色}{$player->umaxhp}{$变量_系统->颜色_颜色完}){$变量_打怪界面->玩家状态}
攻击:($player->ugj)
防御:($player->ufy)
{$变量_打怪界面->战斗提示}

{$变量_打怪界面->链接_普通攻击}
{$变量_系统->链接_返回游戏_按钮短}

{$变量_打怪界面->链接_使用药品1_按钮短}{$变量_打怪界面->链接_使用药品2_按钮短}{$变量_打怪界面->链接_使用药品3_按钮短}';

$排版_修炼 = '{$player->uname}
{$player->jingjie}({$player->ulv})
===============
修炼时间:{$变量_修炼->修炼时间}分钟
修炼收益:{$变量_修炼->修炼经验}修为
===============

注：最多修炼24小时，1440分钟

修炼需要灵石：{$变量_修炼->修炼需要灵石}/{$player->uyxb}
修炼需要极品灵石：{$变量_修炼->修炼需要极品灵石}/{$player->uczb}
{$变量_修炼->链接_使用灵石修炼}{$变量_修炼->链接_使用极品灵石修炼}{$变量_修炼->链接_结束修炼_按钮短}

{$变量_系统->界面_底部开始}
{$变量_系统->链接_返回游戏_按钮长}
{$变量_系统->界面_底部结束}';

$排版_怪物不存在 = '怪物已经被其他人攻击了！
请少侠练习一下手速哦！

{$变量_系统->链接_返回游戏_按钮短}';

$排版_怪物信息 = '[{$guaiwu->gname}]
等级:{$guaiwu->glv}
性别:{$guaiwu->gsex}
信息:{$guaiwu->ginfo}
境界:{$guaiwu->jingjie}
掉落：
{$变量_怪物信息->掉落物品}
{$变量_怪物信息->链接_进入战斗_按钮短}{$变量_系统->链接_返回游戏_按钮短}';

$排版_pve_胜利 ='=====战斗结果 胜利=====
你打死了$guaiwu->gname
战斗胜利！
修为:{$player->uexp}/{$player->umaxexp}(+{$变量_pve_胜利->获得经验})
灵石:{$player->uyxb}(+{$变量_pve_胜利->获得游戏币})
{$变量_pve_胜利->掉落装备}
{$变量_pve_胜利->掉落道具}
{$变量_pve_胜利->掉落药品}
{$变量_pve_胜利->任务进度}

{$变量_系统->链接_返回游戏_按钮短}';



$排版_排行榜 = '排行榜
{$变量_排行榜->排行列表}
{$变量_系统->界面_底部开始}
{$变量_系统->链接_返回游戏_按钮长}
{$变量_系统->界面_底部结束}';


$dis = array(
    "排版_修炼" => $排版_修炼,
    '排版_地图' => $排版_地图,
    '排版_排行榜' => $排版_排行榜,
    '排版_装备列表' => $排版_装备列表,
    '排版_道具列表' => $排版_道具列表,
    '排版_药品列表' => $排版_药品列表,
    '排版_装备信息' => $排版_装备信息,
    '排版_怪物信息' => $排版_怪物信息,
    '排版_打怪界面' => $排版_打怪界面,
    "排版_pve_失败 " => $排版_pve_失败,
    "排版_pve_胜利" => $排版_pve_胜利,
    "排版_复活点列表" => $排版_复活点列表,
    "排版_怪物不存在" => $排版_怪物不存在,
    '排版_当前玩家状态' => $排版_当前玩家状态

);

//------------------------------------------------------------------

$变量_系统 = array(
    '游戏名称'=>'游戏的名称',
    '颜色_红色'=>'设置红色',
    '颜色_绿色'=>'设置绿色',
    '颜色_颜色完'=> '颜色完毕标志',
    '界面_空行'=>"一个不会被去掉的空行",
    "界面_块开始" => "界面块开始",
    "界面_块结束" => "界面块结束",
    "界面_底部开始" => '底部框架开始的标志',
    "界面_底部结束" => '底部框架结束的标志',
    "界面_框架开始" => "界面_框架开始",
    "界面_框架结束" => "界面_框架结束",
    '任务_数量 '=> '身上未完成的任务数量',
    '链接_返回游戏_块' => '链接_返回游戏(块)',
    '链接_返回游戏_链接' => '链接_返回游戏(链接)',
    '链接_返回游戏_按钮短' => '链接_返回游戏(按钮短)',
    '链接_返回游戏_按钮长' => '链接_返回游戏(按钮长)',
    '链接_返回首页' => '返回到登录首页',
    '链接_任务'=> '进入任务界面的链接',
    '链接_状态'=> "进入状态界面的链接",
    '链接_包裹'=> "进入包裹界面的链接",
    '链接_聊天'=> "进入聊天界面的链接",
    '链接_符箓'=> "进入符箓界面的链接",
    '链接_排行'=> "进入排行界面的链接",
    '链接_修炼'=> "进入修炼界面的链接",
    '链接_坊市'=> "进入坊市界面的链接",
    '链接_门派'=> "进入门派界面的链接",
    '链接_好友'=> "进入好友界面的链接",
    '链接_兑换码'=> "进入兑换码界面的链接",
    '链接_查看地图'=> "进入区域复活地图传送界面的链接",
    '装备1位置'=>'装备1的位置名称',
    '装备2位置'=>'装备2的位置名称',
    '装备3位置'=>'装备3的位置名称',
    '装备4位置'=>'装备4的位置名称',
    '装备5位置'=>'装备5的位置名称',
    '装备6位置'=>'装备6的位置名称',

    "链接_装备_按钮短" => "进入装备列表(按钮短)",
    "链接_道具_按钮短" => "进入道具列表(按钮短)",
    "链接_药品_按钮短" => "进入药品列表(按钮短)",
    "链接_技能_按钮短" => "进入技能列表(按钮短)",

    "链接_装备_按钮长" => "进入装备列表(按钮长)",
    "链接_道具_按钮长" => "进入道具列表(按钮长)",
    "链接_药品_按钮长" => "进入药品列表(按钮长)",
    "链接_技能_按钮长" => "进入技能列表(按钮长)",

    "链接_装备_链接" => "进入装备列表(链接)",
    "链接_道具_链接" => "进入道具列表(链接)",
    "链接_药品_链接" => "进入药品列表(链接)",
    "链接_技能_链接" => "进入技能列表(链接)",

    "链接_装备_块" => "进入装备列表(块)",
    "链接_道具_块" => "进入道具列表(块)",
    "链接_药品_块" => "进入药品列表(块)",
    "链接_技能_块" => "进入技能列表(块)",

);


$变量_地图 = [
    '名称'=>'当前地图的名称',
    '属性'=>'如安全区',
    '地图信息'=>'当前地图背景说明',
    '玩家_列表'=>'当前地图在线的玩家列表',
    'NPC_列表'=>'当前地图存在的NPC列表',
    '怪物_列表'=>'当前地图存在怪物列表',
    '聊天_显示'=>'聊天最新的3条记录',
    '系统_提示'=>'系统的一些重要提示',
    '链接_刷新' => "刷新当前地图",
    "链接_出口_上" => '出口_上',
    "链接_出口_下" => '出口_下',
    "链接_出口_左" => '出口_左',
    "链接_出口_右" => '出口_右'
];

$变量_状态 = [
    "装备1" => '玩家装备1链接',
    "装备2" => '玩家装备2链接',
    "装备3" => '玩家装备3链接',
    "装备4" => '玩家装备4链接',
    "装备5" => '玩家装备5链接',
    "装备6" => '玩家装备6链接'
];

$变量_装备信息 = [
    "装备位置"=>"装备位置",
    "链接_强化攻击"=>"功能_强化攻击",
    "链接_强化防御"=>"功能_强化防御",
    "链接_强化气血"=>"功能_强化气血",
    "链接_穿戴装备"=>"功能_穿戴装备",
    "链接_分解装备"=>"功能_分解装备",
    "强化成功率"=>"强化成功率",
    "装备操作提示"=>"装备操作提示",
    "分解所需游戏本"=>"分解所需游戏币",
    "强化需要道具数量"=>"强化需要道具数量"
];

$变量_复活点列表 = [
    "复活点列表" => "显示所有复活点列表",
    "复活点列表_块" => "显示所有复活点列表（用块显示,放在界面_块开始  和 界面_块结束 中间）"
];

$变量_装备列表 = [
    "装备列表"=>"装备列表",
    "链接_翻页"=>"用于装备列表翻页",
    "提示信息"=>"装备操作的提示信息"
];

$变量_药品列表 = [
    '药品列表' => '药品列表'
];

$变量_道具列表 = array(
    "道具列表"=>"道具列表",
);

$变量_打怪界面 = [

    "战斗提示" => "战斗提示",
    "链接_普通攻击" => "链接_普通攻击",
    "链接_使用药品1_块" => "使用药品1_块",
    "链接_使用药品1_链接" => "使用药品1_链接",
    "链接_使用药品1_按钮短" => "使用药品1_按钮短",
    "链接_使用药品1_按钮长" => "使用药品1_按钮长",

    "链接_使用药品2_块" => "使用药品2_块",
    "链接_使用药品2_链接" => "使用药品2_链接",
    "链接_使用药品2_按钮短" => "使用药品2_按钮短",
    "链接_使用药品2_按钮长" => "使用药品2_按钮短",

    "链接_使用药品3_块" => "使用药品3_块",
    "链接_使用药品3_链接" => "使用药品3_链接",
    "链接_使用药品3_按钮短" => "使用药品3_按钮短",
    "链接_使用药品3_按钮长" => "使用药品3_按钮长",

    "玩家状态" => "玩家的状态包含伤害吸血暴击",
    "怪物状态" => "怪物的状态包含伤害吸血暴击"
];

$变量_pve_胜利 = [
    "掉落装备" => "掉落装备",
    "掉落道具" => "掉落道具",
    "掉落药品" => "掉落药品",
    "获得经验" => "获得经验",
    "获得游戏币" =>"获得游戏币",
    "任务进度" => "任务进度"
];

$变量_修炼 = array(
    "提示信息" => "提示信息",
    "修炼时间" => "修炼时间",
    "修炼经验" => "修炼经验" ,
    "修炼需要灵石" => "修炼需要灵石",
    "修炼需要极品灵石" => "修炼需要极品灵石",
    "链接_结束修炼_块" => "链接_结束修炼_块",
    "链接_结束修炼_链接" => "链接_结束修炼_链接",
    "链接_结束修炼_按钮短" => "链接_结束修炼_按钮短",
    "链接_结束修炼_按钮长" => "链接_结束修炼_按钮长",
    "链接_使用灵石修炼"=> "链接_使用灵石修炼",
    "链接_使用极品灵石修炼"=> "链接_使用极品灵石修炼",

);

$变量_怪物信息 = array(
    "掉落物品"=>"掉落物品",
    "链接_进入战斗_块"=>"链接_进入战斗_块",
    "链接_进入战斗_链接"=>"链接_进入战斗_链接",
    "链接_进入战斗_按钮短"=>"链接_进入战斗_按钮短",
    "链接_进入战斗_按钮长"=>"链接_进入战斗_按钮长",
);

$变量_排行榜 = array(
    "排行列表"=>"排行列表"
);



$dis_var_temp = array(
    '变量_系统'=>$变量_系统,
    '变量_修炼'=>$变量_修炼,
    '变量_地图'=>$变量_地图,
    '变量_状态'=>$变量_状态,
    '变量_排行榜'=>$变量_排行榜,
    '变量_装备列表'=>$变量_装备列表,
    "变量_道具列表"=>$变量_道具列表,
    '变量_药品列表'=>$变量_药品列表,
    "变量_装备信息"=>$变量_装备信息,
    "变量_打怪界面"=>$变量_打怪界面,
    "变量_怪物信息"=>$变量_怪物信息,
    '变量_复活点列表'=>$变量_复活点列表,
    '变量_pve_胜利' => $变量_pve_胜利
);




$init = array("ver"=>1,"system_config"=>$system_config , "math"=>$math , "dis"=>$dis,"dis_var"=>$dis_var_temp);

echo json_encode($init);


